# Алфавит зашифрованного текста
ENCRYPTED_ALPHABET = 'КХ?ЕrПЫО7ЬДР4УБАca<1tЙ5М>8Иb2ЧЛ Ф'

#Пути к файлам
ENCODED_FILE = 'encoded.txt'
DECRYPTED_FILE = 'decrypted.txt'
FOUND_KEY_FILE = 'found_key.txt'

# Итоговый, заранее определенный ключ для дешифровки
FINAL_KEY = {
    'c' : ' ',
    'А' : 'О',
    'Х' : 'И',
    '8' : 'Е',
    'М' : 'Т',
    'r' : 'Н',
    'Л' : 'С',
    'О' : 'А',
    '2' : 'К',
    'b' : 'Я',
    'К' : 'Р',
    'Е' : 'М',
    'Д' : 'Л',
    'Б' : 'П',
    'Р' : 'В',
    '7' : 'Д',
    '4' : 'Ь',
    't' : 'У',
    '<' : 'Ч',
    '1' : 'Й',
    'Ф' : 'З',
    'У' : 'Ж',
    '5' : 'Э',
    ' ' : 'Ы',
    '>' : 'Г',
    'Ч' : 'Ц',
    '?' : 'Ъ',
    'И' : 'Ф',
    'П' : 'Б',
    'a' : 'Ю',
    'Й' : 'Х',
    'Ь' : 'Щ',
    'Ы' : 'Ш'
}